[
  {
    "title": "Lighter Chicken Parmesan",
    "total_time": 16,
    "servings": "4 serving(s)",
    "ingredients": [
      "One 24-ounce jar good-quality marinara sauce",
      "1 tablespoon balsamic vinegar",
      "1/2 cup panko breadcrumbs",
      "1/2 cup grated Parmesan",
      "1/4 cup finely chopped fresh flat-leaf parsley",
      "Kosher salt and freshly ground black pepper",
      "2 large egg whites, lightly beaten",
      "1 1/2 pounds chicken tenders",
      "12 ounces whole-wheat angel hair pasta",
      "1 tablespoon olive oil",
      "1/2 cup shredded fresh mozzarella"
    ],
    "instructions": "Preheat the broiler to medium. Bring a large pot of water to a boil.\nCombine the marinara sauce and balsamic vinegar in a small saucepan and bring to a boil over high heat. Reduce the heat and simmer for 5 minutes.\nMeanwhile, in a shallow dish, combine the breadcrumbs, half the Parmesan, half the parsley and some salt and pepper. Put the beaten egg whites in a separate shallow dish. Coat the chicken tenders in the egg whites first, then dredge in the breadcrumb mixture.\nAdd the pasta to the boiling water and cook according to the package instructions.\nHeat the oil in a large ovenproof nonstick skillet over medium-high heat. Add the chicken and cook, turning once, until golden, about 3 minutes per side. Pour the tomato sauce over the chicken, scatter the mozzarella and remaining Parmesan evenly over top and broil until the cheese is melted and bubbly, about 2 minutes.\nDrain the pasta. Serve with the chicken and garnish with the remaining parsley.",
    "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/12/4/0/WU1504H_lighter-chicken-parmesan_s4x3.jpg.rend.hgtvcom.406.305.suffix/1480899697576.jpeg",
    "source": "foodnetwork.com",
    "tags": [
      "Chicken Recipes",
      "Poultry",
      "Main Dish"
    ]
  },
  {
    "title": "Chana Masala",
    "total_time": 585,
    "servings": "4 serving(s)",
    "ingredients": [
      "1 cup dried chickpeas, soaked overnight",
      "1 pinch of baking soda",
      "2 bay leaves",
      "1 black tea bag (or 2 teaspoons black tea leaves in a muslin bag)",
      "1 black cardamom pod",
      "Kosher salt",
      "1/4 cup ghee or oil (I like to use a combination of both)",
      "2 medium onions, chopped (about 1 3/4 cups)",
      "One 2-inch piece fresh ginger, peeled and grated or mashed",
      "2 medium cloves garlic, grated or finely minced",
      "1 to 4 Thai green chiles or serrano peppers, finely chopped (see Cook's Note)",
      "3 plum tomatoes, peeled and chopped (or whole peeled canned tomatoes, chopped; 1 cup)",
      "Roasted Chana Masala Spice Blend, recipe follows",
      "Fresh cilantro, for serving",
      "Lime wedges, for serving, optional",
      "Julienned ginger slaw, for serving, optional (see Cook's Note)",
      "1 1/2 teaspoons coriander seeds",
      "1 1/2 teaspoons cumin seeds",
      "1/2 teaspoon black peppercorns",
      "One 2-inch piece cinnamon",
      "2 black cardamom pods",
      "2 teaspoons dried pomegranate powder (anardana)",
      "1 teaspoon raw mango powder (amchur)",
      "1 teaspoon black salt, such as Himalayan black salt or kala namak",
      "1 teaspoon red chile powder",
      "1/4 teaspoon turmeric",
      "1/4 teaspoon asafoetida (hing)"
    ],
    "instructions": "Drain the chickpeas, then combine them in a large Dutch oven with the baking soda, bay leaves, black tea bag, black cardamom, 1 teaspoon salt and 3 cups of water. (To pressure cook the chickpeas, see Cook’s Note.) Bring the mixture to a boil in a large Dutch oven, then reduce to a simmer and cook, partially covered with a lid, until the chickpeas are tender, about 1 hour. If the liquid is evaporating too quickly before the chickpeas are tender, pour in an additional 1 cup of water and continue to cook. Discard the tea bag, bay leaves and cardamom. Drain the chickpeas and put them back in the pot.\nMeanwhile, heat the ghee and/or oil in a large skillet or saucepan over medium-high heat. Add the onions and 1/2 teaspoon salt and cook, stirring and scraping occasionally, until the onions are very soft and golden brown, 10 to 12 minutes.\nAdd the ginger, garlic and green chiles and cook until the raw smell goes away, about 3 minutes. Add the tomatoes and 1/2 teaspoon salt and cook until well cooked and pasty, about 8 minutes. Add the Roasted Chana Masala Spice Blend along with 2 tablespoons of water and saute until well mixed and the flavors have melded, 3 to 5 minutes.\nAdd the spice mixture to the chickpeas with 1 cup of water (see Cook's Note), mix well and bring to a simmer over medium heat; simmer until the curry thickens and coats and infuses the chickpeas, about 5 minutes. Adjust salt to taste. Garnish with fresh cilantro and serve with lime wedges or julienned ginger slaw, if desired.\nCombine the whole spices (coriander, cumin, black pepper, cinnamon and cardamom) in a small heavy skillet (preferably cast iron, if you have it) and roast over medium-high heat, shaking the pan often to ensure even roasting, until the spices start getting darker, 3 to 4 minutes. Lower the heat to low and add the powdered spices (pomegranate powder, mango powder, black salt, chile powder, turmeric and asafoetida) and cook, shaking or stirring constantly, until slightly darker, about 30 seconds. Be careful not to burn the spices. Immediately transfer the spices to a bowl and cool. Once cooled, grind the spices. You can double or triple this recipe and keep it in an airtight container for future use.",
    "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2021/02/25/0/FNK_Chana-Masala_H2_s4x3.jpg.rend.hgtvcom.406.305.suffix/1614271965516.jpeg",
    "source": "foodnetwork.com",
    "tags": [
      "Indian Recipes",
      "Curry Recipes",
      "Beans and Legumes",
      "Main Dish"
    ]
  },
  {
    "title": "Herbed Chicken Marsala",
    "total_time": 35,
    "servings": "4 serving(s)",
    "ingredients": [
      "Four 4-ounce boneless, skinless chicken breast cutlets",
      "Kosher salt and freshly ground black pepper",
      "1/3 cup whole wheat flour",
      "1 1/2 tablespoons extra-virgin olive oil",
      "3/4 cup low-sodium chicken broth",
      "1/3 cup sun-dried tomatoes (not packed in oil; not rehydrated), finely chopped or very thinly sliced",
      "1/2 teaspoon finely chopped rosemary",
      "10 ounces white button or cremini (baby bella) mushrooms, sliced",
      "1/3 cup sweet marsala wine",
      "2 teaspoons unsalted butter",
      "1 to 2 tablespoons roughly chopped flat-leaf parsley"
    ],
    "instructions": "Place the chicken cutlets between 2 pieces of plastic wrap and pound with a meat mallet (or the flat side of a chef's knife) until about 1/3-inch thick. Sprinkle with 1/4 teaspoon salt and 1/4 teaspoon pepper.\nPut the flour on a medium plate. Heat the oil in a large nonstick skillet over medium-high heat. Dredge the chicken in the flour to fully coat, shaking off any excess. Add the chicken to the skillet and fry until fully cooked and golden brown, about 4 minutes per side. Transfer to a platter and tent with foil to keep warm.\nAdd 1/2 cup of the broth, the sun-dried tomatoes and rosemary to any remaining drippings in the skillet and cook, stirring frequently, for 1 minute to plump the tomatoes. Add the mushrooms, 1/4 teaspoon salt and 1/2 teaspoon pepper and cook until the mushrooms are soft, about 5 minutes. Add the marsala and bring to a boil. Add the remaining 1/4 cup broth and the butter and simmer until the butter is fully melted, about 30 seconds.\nSpoon the mushroom mixture and sauce over the chicken, sprinkle with the parsley and serve.",
    "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2013/2/14/0/FNK_Herbed-Chicken-Marsala_s4x3.jpg.rend.hgtvcom.406.305.suffix/1371614296995.jpeg",
    "source": "foodnetwork.com",
    "tags": [
      "Healthy",
      "Chicken Recipes",
      "Poultry",
      "Main Dish",
      "Low-Fat",
      "Low Calorie",
      "Diabetes-Friendly"
    ]
  },
  {
    "title": "Low-Fat Cheesecake",
    "total_time": 600,
    "servings": "14 serving(s)",
    "ingredients": [
      "Cooking spray",
      "9 whole low-fat cinnamon graham crackers, broken in half",
      "2 tablespoons unsalted butter, melted",
      "2 8-ounce packages Neufchatel cream cheese, softened",
      "2 8-ounce packages fat-free cream cheese, softened",
      "1 1/2 cups sugar",
      "1 cup reduced-fat sour cream",
      "2 large eggs plus 3 egg whites",
      "2 tablespoons all-purpose flour",
      "1 teaspoon vanilla extract",
      "1 teaspoon finely grated lemon zest",
      "Assorted toppings"
    ],
    "instructions": "Preheat the oven to 350 degrees F. Wrap the outside of a 9-inch springform pan with foil to prevent leaks. Coat the inside of the pan with cooking spray.\nPulse the graham crackers in a food processor until crumbled. Add 1 to 2 tablespoons water and the butter; pulse until moistened. Press the crumbs onto the bottom of the prepared pan. Bake until browned, about 8 minutes. Let cool, about 10 minutes.\nMeanwhile, beat both cream cheeses and the sugar with an electric mixer on medium-high speed until smooth, about 5 minutes. Beat in the sour cream on low. Lightly whisk the 3 egg whites in a bowl, then add to the cheese mixture along with the 2 whole eggs, flour, vanilla and lemon zest. Beat on medium speed until fluffy, about 3 minutes. Pour over the crust.\nPlace the cheesecake in a roasting pan and add enough warm water to come one-quarter of the way up the sides of the springform. Bake until the cake is set but the center still jiggles, about 1 hour 10 minutes. Turn off the oven; keep the cheesecake inside with the door closed for 20 minutes.\nRemove the cake from the water bath and transfer to a rack. Run a knife around the edge, then cool completely. Chill until firm, at least 8 hours. Top as desired.",
    "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/1/21/3/FNM_030110-Lighten-Up-002_s4x3.jpg.rend.hgtvcom.406.305.suffix/1382539263558.jpeg",
    "source": "foodnetwork.com",
    "tags": [
      "Easy Dessert Recipes",
      "Dessert",
      "Easy Baking",
      "Baking",
      "Cheesecake",
      "Cream Cheese Recipes",
      "Egg Recipes",
      "Sugar",
      "Recipes for a Crowd"
    ]
  },
  {
    "title": "Chicken With Mango Barbeque Sauce",
    "total_time": 102,
    "servings": "4 serving(s)",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 onion, diced (about 1 cup)",
      "1 red pepper, diced (about 1 cup)",
      "3 cloves garlic, coarsely chopped",
      "1 teaspoon salt",
      "Freshly ground black pepper",
      "1/2 teaspoon ground allspice",
      "1/3 cup red wine vinegar",
      "3 tablespoons molasses",
      "2 tablespoons Worcestershire sauce",
      "2 tablespoons lime juice",
      "1/4 cup low-sodium tomato sauce",
      "1 mango, diced (about 1 1/2 cups)",
      "2 to 3 jalapenos, minced",
      "2 boneless, skinless chicken breasts (about 3/4 pound each)"
    ],
    "instructions": "Heat the oil in a medium-sized skillet over medium-high. Add the onions and cook until translucent, about 2 minutes. Add the red peppers, garlic, salt and pepper, and allspice and cook for 2 minutes more. Stir in the vinegar, molasses, Worcestershire sauce, lime juice and tomato sauce and cook for 1 minute more. Transfer the mixture into a bender and add the mango and jalapeno. Blend until smooth.\nPut 1 cup of the barbeque sauce into a resealable plastic bag with the chicken and marinate for 1 hour.\nPreheat the broiler. Put the chicken on a broiler pan and discard the marinade. Broil the chicken on high for about 12 minutes, turning once. Let the meat rest for 10 minutes before slicing. Spoon about 1/2 cup of barbeque sauce over the meat slices and serve.",
    "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2007/2/15/0/ek0207_bbqmangochicken.jpg.rend.hgtvcom.406.305.suffix/1371585592336.jpeg",
    "source": "foodnetwork.com",
    "tags": [
      "Healthy",
      "Caribbean",
      "Sauce Recipes",
      "Chicken Recipes",
      "Poultry",
      "Fruit",
      "Mango",
      "Onion Recipes",
      "Jalapeno Recipes",
      "Tomato"
    ]
  }
]